{
  "backend/main.mo": "Empty Motoko actor with no methods or state, serving as a placeholder backend.",
  "feature_evidence.json": "Feature evidence report documenting three implemented features: 2-column shoe gallery layout, shop name update to 'hari traders', and contact number update to +919056156995.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files describing component purposes and styling approach for the luxury shoe store website.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining luxury-themed CSS variables for light and dark modes with neutral grayscale palette.",
  "frontend/index.html": "HTML entry point with basic meta tags, title 'luxury shop', and root div mounting the React application.",
  "frontend/src/App.tsx": "Root React component composing Hero, ShoeGallery, Reviews, and ContactInfo sections into a single-page layout.",
  "frontend/src/components/ContactInfo.tsx": "Footer component with phone and WhatsApp buttons for +919056156995, copyright notice for 'hari traders', and caffeine.ai attribution link.",
  "frontend/src/components/Hero.tsx": "Header section displaying 'hari traders' brand name, logo image, sparkle icons, and tagline about premium footwear collection.",
  "frontend/src/components/Reviews.tsx": "Customer testimonials section displaying 4 reviews in a 2-column grid with profile images, names, 5-star ratings, and review text.",
  "frontend/src/components/ShoeGallery.tsx": "Gallery component displaying 5 shoe products in a fixed 2-column grid with images, titles, hover effects, and luxury styling.",
  "frontend/src/hooks/useActor.ts": "React hook managing ICP actor creation with Internet Identity authentication, query caching, and automatic invalidation on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication on ICP, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file indicating no backend data fetching is required for this static showcase website.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with a luxury-themed color palette using OKLCH color space, including light/dark mode variants, custom shadows, and typography settings.",
  "frontend/src/main.tsx": "Application entry point that renders the root component wrapped with QueryClientProvider and InternetIdentityProvider for state management and authentication.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with luxury-themed colors (OKLCH format), custom fonts (Inter, Playfair Display), animations, and responsive container settings.",
  "project_state.json": "Project metadata tracking three feature requests: changing shoe gallery to 2-column layout, updating shop name to 'hari traders', and updating contact number to +919056156995."
}