{
  "backend/main.mo": "Empty Motoko actor with no methods or state, serving as a placeholder backend.",
  "feature_evidence.json": "Feature evidence report documenting two completed features: removing shoe name text from gallery cards and adding 7 additional shoe images to maintain a 12-item collection.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of frontend files describing a luxury shoe store website with Hero, ShoeGallery (12 images, no names), Reviews, and ContactInfo components.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color variables for light and dark modes, defining a luxury-themed color palette with minimal customization.",
  "frontend/index.html": "Basic HTML entry point with a root div and module script reference to main.tsx, titled 'luxury shop'.",
  "frontend/src/App.tsx": "Main app component composing Hero, ShoeGallery, Reviews, and ContactInfo into a single-page layout.",
  "frontend/src/components/ContactInfo.tsx": "Footer component with phone and WhatsApp contact buttons, copyright notice, and caffeine.ai attribution with UTM tracking.",
  "frontend/src/components/Hero.tsx": "Hero section displaying Hari Traders logo, brand name, and tagline with luxury styling and gold accents.",
  "frontend/src/components/Reviews.tsx": "Customer testimonials section displaying 4 reviews in a grid with profile images, names, 5-star ratings, and review text.",
  "frontend/src/components/ShoeGallery.tsx": "Gallery component displaying 12 men's shoe images in a fixed 2-column grid with hover effects, showing only images without product names.",
  "frontend/src/hooks/useActor.ts": "React hook managing ICP actor creation with Internet Identity authentication, handling both authenticated and anonymous actors with query invalidation on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider for Internet Identity authentication on ICP, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file indicating no backend data fetching is required for this static showcase website.",
  "frontend/src/index.css": "Tailwind CSS configuration with luxury-themed color palette using OKLCH color space, defining CSS variables for light/dark modes and custom shadow utilities with gold accents.",
  "frontend/src/main.tsx": "Application entry point that renders the root component with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the theme with luxury color system, custom fonts (Inter, Playfair Display), animations, and responsive container settings.",
  "project_state.json": "Project metadata tracking a men's shoe collection web app with pending feature requests to remove shoe names from cards and add 7 additional product images to the gallery."
}