{
  "backend/main.mo": "Empty Motoko actor with no methods or state, serving as a minimal backend placeholder.",
  "feature_evidence.json": "Feature evidence report documenting two completed features: replacing shoe gallery images with men's branded footwear and updating product titles/descriptions to match the new images.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files describing the luxury shoe store website components, styling, and configuration.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining luxury-themed design tokens for light and dark modes with gold accents.",
  "frontend/index.html": "HTML entry point with root div and module script reference for the React application titled 'luxury shop'.",
  "frontend/src/App.tsx": "Root React component composing Hero, ShoeGallery, Reviews, and ContactInfo sections into a single-page luxury shoe store layout.",
  "frontend/src/components/ContactInfo.tsx": "Footer component with phone and WhatsApp contact buttons, copyright information, and caffeine.ai attribution with UTM tracking.",
  "frontend/src/components/Hero.tsx": "Hero section displaying Hari Traders logo, brand name with sparkle icons, and tagline with luxury styling and gold accents.",
  "frontend/src/components/Reviews.tsx": "Customer testimonials section displaying 4 reviews in a grid layout with profile images, names, 5-star ratings, and review text with luxury styling.",
  "frontend/src/components/ShoeGallery.tsx": "Gallery component showcasing 5 men's branded shoes (Adidas, Nike, Puma, Asian, Premium Casual) in a fixed 2-column grid with hover effects and luxury card styling.",
  "frontend/src/hooks/useActor.ts": "React hook managing ICP backend actor creation with identity-based authentication, query caching, and automatic refetching on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook providing Internet Identity authentication with login/logout functionality, identity management, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Intentionally empty file as the backend has no methods and the website is static with no data fetching requirements.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom luxury-themed color palette (light/dark modes), OKLCH color space variables, and custom shadow utilities for gold accents.",
  "frontend/src/main.tsx": "React application entry point that sets up QueryClient, InternetIdentityProvider, and renders the root App component.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme with custom colors (luxury-gold, sidebar, chart), font families (Inter, Playfair Display), border radius variables, and animation keyframes.",
  "project_state.json": "Project metadata for Hari Traders menswear e-commerce site tracking features for replacing shoe gallery images with men's branded footwear (Adidas, Nike, Puma, Asian) and updating product descriptions."
}